src/Reports/АнализВремениОбслуживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>АнализВремениОбслуживания</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассивСмен</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопГруппировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийВидНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/АнализВремениОбслуживания/Forms/ФормаОтчета/module.bsl
Процедура ДействияФормыКратко(Кнопка)
	Форма =  ПолучитьФорму("ФормаНастройки", ЭтаФорма);
	Форма.ОткрытьМодально();
КонецПроцедуры

// Обработчик формирования отчета
//
Процедура ДействияФормыСформировать(Кнопка) 
	
	СформироватьОтчет(ЭлементыФормы.Результат,ЭлементыФормы);
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	Если Не ЗначениеЗаполнено(ВариантФормирования) Тогда
		ВариантФормирования = "АвторЗаказано";
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ДатаС) И Не ЗначениеЗаполнено(ДатаПо) И Не ЗначениеЗаполнено(МассивСмен) Тогда 
		ДатаС = НачалоКвартала(ТекущаяДата());
		ДатаПо = ТекущаяДата();
		Период = ПредставлениеПериода(ДатаС,ДатаПо);
	КонецЕсли;	
	
КонецПроцедуры

Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормированиеОтчетов.РасшифровкаОтчетов(ЭтотОбъект, Расшифровка);
	
КонецПроцедуры


Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	ФормированиеОтчетов.ПередОткрытиемОтчета(ЭтаФорма);	
	//Если Не Константы.ПодтверждениеГотовности.Получить() Тогда
	Если Не Константы.РаботаСПодтверждениямиПозицийЗаказа.Получить() Тогда
		Сообщить("Построение отчета не возможно. Данные подтверждения готовности блюд не учитываются.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

Процедура КоманднаяПанельФормыБыстрыеОтборы(Элемент)
	ФормированиеОтчетов.УправлениеОтображениемЭлементовФормы(ЭтаФорма,Элемент);
КонецПроцедуры

Процедура КнопкаПериодаНажатие(Элемент)
	
	ФормированиеОтчетов.КнопкаПериодНажатие(ЭтотОбъект);
	
КонецПроцедуры

Процедура КнопкаСменыНажатие(Элемент)

	ФормированиеОтчетов.КнопкаСменаНажатие(ЭтотОбъект);
	
КонецПроцедуры
